tutorials/pimpleHFDIBFoam/impellerAndSphere/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ( "impellerSphere" "sphere3" );

surfaceThreshold    1e-4;
stepDEM     0.02;
geometricD (1 1 -1);
recordSimulation true;
virtMeshDecompositionLevel 2;

outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel true;
    parallelDEM false;
}

DEM
{
    materials
    {
        particle
        {
            Y       1e7;
            nu      0.2;
            gamma   20;
            mu      0;
            adhN    0;
        }

        wall
        {
            Y       1e7;
            nu      0.2;
            gamma   20;
            mu      0;
            adhN    0;
        }
    }

    collisionPatches
    {
        movingWall wall;
        fixedWalls wall;
    }
}

impellerSphere
{
prescribedTransRotBody
 {
    axis     (0 0 -1);
    velocity (0 0 0);
    omega    20;
 }
rho         rho [1 -3 0 0 0 0 0] 3950;
U
{
	BC  noSlip;
}
material particle;
bodyGeom nonConvex;
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
refineBuffers 2;
timesToSetStatic -1;
bodyAddition
{
	addModel once;
	distributionCoeffs
	{
		addMode fieldBased;
        stlBaseSize        1e-5;
		fieldBasedCoeffs
		{
			fieldName lambda;
			fieldValue 0.05;
		}
		addDomain boundBox;
		boundBoxCoeffs
		{
			minBound (0 -0.00004 0);
			maxBound (0.0001628 -0.00001 0.0001628);
		}
	}
}
}

sphere3
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 3950;
U
{
	BC  noSlip;
}
material particle;
bodyGeom sphere;
sphere
{
    startPosition   (9e-3 0.046 0);
    radius  0.006;
}
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
refineBuffers 2;
timesToSetStatic -1;
bodyAddition
{
	addModel once;
	distributionCoeffs
	{
		addMode fieldBased;
        stlBaseSize        1e-5;
		fieldBasedCoeffs
		{
			fieldName lambda;
			fieldValue 0.05;
		}
		addDomain boundBox;
		boundBoxCoeffs
		{
			minBound (0 -0.00004 0);
			maxBound (0.0001628 -0.00001 0.0001628);
		}
	}
}
}
// ************************************************************************* //
